export const diffs = [
    {
        name: '苍蓝',
        origin: [
            19,
            72,
            88,
        ],
        target: [
            19,
            71,
            93,
        ],
    },
    {
        name: '藏青',
        origin: [
            6,
            10,
            37,
        ],
        target: [
            45,
            49,
            61,
        ],
    },
    {
        name: '飞燕草蓝',
        origin: [
            15,
            89,
            164,
        ],
        target: [
            17,
            94,
            172,
        ],
    },
    {
        name: '翠蓝',
        origin: [
            39,
            218,
            248,
        ],
        target: [
            61,
            206,
            253,
        ],
    },
    {
        name: '靛青',
        origin: [
            32,
            61,
            95,
        ],
        target: [
            19,
            23,
            34,
        ],
    },
    {
        name: '青金',
        origin: [
            40,
            49,
            126,
        ],
        target: [
            31,
            39,
            124,
        ],
    },
    {
        name: '佛青',
        origin: [
            10,
            30,
            81,
        ],
        target: [
            16,
            22,
            54,
        ],
    },
    {
        name: '海青',
        origin: [
            34,
            163,
            195,
        ],
        target: [
            4,
            57,
            72,
        ],
    },
    {
        name: '霁青',
        origin: [
            44,
            48,
            73,
        ],
        target: [
            26,
            35,
            74,
        ],
    },
    {
        name: '虾青',
        origin: [
            103,
            119,
            132,
        ],
        target: [
            124,
            144,
            159,
        ],
    },
    {
        name: '品月',
        origin: [
            122,
            171,
            239,
        ],
        target: [
            122,
            171,
            229,
        ],
    },
    {
        name: '雨过天青',
        origin: [
            127,
            176,
            183,
        ],
        target: [
            145,
            198,
            202,
        ],
    },
    {
        name: '雀头青',
        origin: [
            41,
            76,
            118,
        ],
        target: [
            41,
            76,
            231,
        ],
    },
    {
        name: '天蓝',
        origin: [
            102,
            203,
            255,
        ],
        target: [
            23,
            184,
            253,
        ],
    },
    {
        name: '燕尾青',
        origin: [
            56,
            62,
            88,
        ],
        target: [
            30,
            34,
            51,
        ],
    },
    {
        name: '月白',
        origin: [
            243,
            242,
            248,
        ],
        target: [
            201,
            215,
            227,
        ],
    },
    {
        name: '竹月',
        origin: [
            89,
            173,
            206,
        ],
        target: [
            89,
            172,
            207,
        ],
    },
    {
        name: '茶褐',
        origin: [
            93,
            61,
            33,
        ],
        target: [
            47,
            30,
            20,
        ],
    },
    {
        name: '丁香褐',
        origin: [
            143,
            109,
            100,
        ],
        target: [
            113,
            55,
            31,
        ],
    },
    {
        name: '沉香褐',
        origin: [
            103,
            83,
            80,
        ],
        target: [
            87,
            65,
            61,
        ],
    },
    {
        name: '豆沙',
        origin: [
            135,
            61,
            36,
        ],
        target: [
            72,
            45,
            36,
        ],
    },
    {
        name: '酱茶褐',
        origin: [
            36,
            0,
            0,
        ],
        target: [
            76,
            55,
            47,
        ],
    },
    {
        name: '古铜',
        origin: [
            87,
            72,
            69,
        ],
        target: [
            80,
            48,
            31,
        ],
    },
    {
        name: '椒褐',
        origin: [
            111,
            80,
            95,
        ],
        target: [
            70,
            44,
            43,
        ],
    },
    {
        name: '枯竹褐',
        origin: [
            103,
            83,
            82,
        ],
        target: [
            168,
            149,
            121,
        ],
    },
    {
        name: '鹿皮褐',
        origin: [
            103,
            52,
            35,
        ],
        target: [
            207,
            142,
            93,
        ],
    },
    {
        name: '米色',
        origin: [
            114,
            54,
            30,
        ],
        target: [
            242,
            240,
            212,
        ],
    },
    {
        name: '墨缃',
        origin: [
            102,
            84,
            62,
        ],
        target: [
            38,
            25,
            25,
        ],
    },
    {
        name: '山鸡褐',
        origin: [
            152,
            101,
            36,
        ],
        target: [
            152,
            106,
            76,
        ],
    },
    {
        name: '罗汉果',
        origin: [
            189,
            126,
            73,
        ],
        target: [
            116,
            91,
            71,
        ],
    },
    {
        name: '檀褐',
        origin: [
            82,
            68,
            65,
        ],
        target: [
            86,
            48,
            45,
        ],
    },
    {
        name: '棠梨褐',
        origin: [
            175,
            127,
            107,
        ],
        target: [
            155,
            102,
            81,
        ],
    },
    {
        name: '铁棕',
        origin: [
            57,
            35,
            34,
        ],
        target: [
            57,
            34,
            34,
        ],
    },
    {
        name: '驼色',
        origin: [
            111,
            80,
            52,
        ],
        target: [
            125,
            93,
            70,
        ],
    },
    {
        name: '橡子棕',
        origin: [
            124,
            71,
            59,
        ],
        target: [
            142,
            71,
            59,
        ],
    },
    {
        name: '枣褐',
        origin: [
            89,
            73,
            76,
        ],
        target: [
            102,
            56,
            57,
        ],
    },
    {
        name: '赭石',
        origin: [
            143,
            64,
            21,
        ],
        target: [
            195,
            96,
            66,
        ],
    },
    {
        name: '砖褐',
        origin: [
            123,
            86,
            67,
        ],
        target: [
            116,
            69,
            59,
        ],
    },
    {
        name: '紫檀',
        origin: [
            83,
            24,
            26,
        ],
        target: [
            79,
            26,
            34,
        ],
    },
    {
        name: '茶花红',
        origin: [
            238,
            63,
            78,
        ],
        target: [
            233,
            60,
            75,
        ],
    },
    {
        name: '大红',
        origin: [
            236,
            4,
            52,
        ],
        target: [
            217,
            2,
            35,
        ],
    },
    {
        name: '粉红',
        origin: [
            246,
            168,
            168,
        ],
        target: [
            217,
            177,
            178,
        ],
    },
    {
        name: '退红',
        origin: [
            247,
            222,
            244,
        ],
        target: [
            247,
            192,
            194,
        ],
    },
    {
        name: '枫叶红',
        origin: [
            252,
            21,
            27,
        ],
        target: [
            232,
            66,
            55,
        ],
    },
    {
        name: '凤仙花红',
        origin: [
            229,
            144,
            167,
        ],
        target: [
            229,
            178,
            211,
        ],
    },
    {
        name: '芙蓉红',
        origin: [
            223,
            177,
            206,
        ],
        target: [
            223,
            179,
            206,
        ],
    },
    {
        name: '绀红',
        origin: [
            119,
            38,
            70,
        ],
        target: [
            164,
            87,
            121,
        ],
    },
    {
        name: '海棠红',
        origin: [
            255,
            81,
            114,
        ],
        target: [
            242,
            85,
            115,
        ],
    },
    {
        name: '鹤顶红',
        origin: [
            207,
            18,
            36,
        ],
        target: [
            218,
            29,
            59,
        ],
    },
    {
        name: '豇豆红',
        origin: [
            236,
            157,
            178,
        ],
        target: [
            226,
            141,
            158,
        ],
    },
    {
        name: '满江红',
        origin: [
            166,
            84,
            90,
        ],
        target: [
            175,
            95,
            101,
        ],
    },
    {
        name: '绛红',
        origin: [
            94,
            3,
            18,
        ],
        target: [
            142,
            20,
            3,
        ],
    },
    {
        name: '木红',
        origin: [
            179,
            113,
            99,
        ],
        target: [
            195,
            129,
            115,
        ],
    },
    {
        name: '玫瑰红',
        origin: [
            212,
            97,
            140,
        ],
        target: [
            210,
            52,
            126,
        ],
    },
    {
        name: '猩红',
        origin: [
            195,
            54,
            44,
        ],
        target: [
            118,
            38,
            39,
        ],
    },
    {
        name: '柿红',
        origin: [
            255,
            74,
            17,
        ],
        target: [
            230,
            83,
            33,
        ],
    },
    {
        name: '曙红',
        origin: [
            169,
            26,
            46,
        ],
        target: [
            88,
            27,
            22,
        ],
    },
    {
        name: '茜色',
        origin: [
            121,
            6,
            9,
        ],
        target: [
            149,
            26,
            30,
        ],
    },
    {
        name: '水红',
        origin: [
            255,
            135,
            199,
        ],
        target: [
            253,
            155,
            196,
        ],
    },
    {
        name: '杏子红',
        origin: [
            252,
            189,
            148,
        ],
        target: [
            244,
            141,
            100,
        ],
    },
    {
        name: '乌红',
        origin: [
            112,
            35,
            43,
        ],
        target: [
            103,
            52,
            59,
        ],
    },
    {
        name: '胭脂',
        origin: [
            227,
            135,
            156,
        ],
        target: [
            241,
            118,
            146,
        ],
    },
    {
        name: '嫣红',
        origin: [
            222,
            62,
            170,
        ],
        target: [
            220,
            139,
            208,
        ],
    },
    {
        name: '银红',
        origin: [
            218,
            114,
            151,
        ],
        target: [
            216,
            141,
            156,
        ],
    },
    {
        name: '银朱',
        origin: [
            209,
            41,
            32,
        ],
        target: [
            245,
            62,
            5,
        ],
    },
    {
        name: '樱桃红',
        origin: [
            196,
            20,
            31,
        ],
        target: [
            196,
            20,
            30,
        ],
    },
    {
        name: '枣红',
        origin: [
            124,
            24,
            36,
        ],
        target: [
            101,
            30,
            24,
        ],
    },
    {
        name: '踯躅红',
        origin: [
            229,
            83,
            207,
        ],
        target: [
            213,
            86,
            192,
        ],
    },
    {
        name: '朱红',
        origin: [
            247,
            22,
            2,
        ],
        target: [
            233,
            61,
            21,
        ],
    },
    {
        name: '棕红',
        origin: [
            61,
            5,
            4,
        ],
        target: [
            113,
            64,
            54,
        ],
    },
    {
        name: '橙皮黄',
        origin: [
            251,
            161,
            3,
        ],
        target: [
            252,
            151,
            0,
        ],
    },
    {
        name: '大豆黄',
        origin: [
            251,
            205,
            49,
        ],
        target: [
            249,
            206,
            108,
        ],
    },
    {
        name: '鹅黄',
        origin: [
            226,
            162,
            74,
        ],
        target: [
            250,
            220,
            65,
        ],
    },
    {
        name: '槐花黄',
        origin: [
            253,
            217,
            7,
        ],
        target: [
            240,
            208,
            71,
        ],
    },
    {
        name: '茧黄',
        origin: [
            240,
            210,
            71,
        ],
        target: [
            240,
            210,
            74,
        ],
    },
    {
        name: '金黄',
        origin: [
            255,
            144,
            3,
        ],
        target: [
            241,
            135,
            9,
        ],
    },
    {
        name: '金盏黄',
        origin: [
            253,
            195,
            7,
        ],
        target: [
            252,
            195,
            7,
        ],
    },
    {
        name: '金莲花橙',
        origin: [
            248,
            107,
            28,
        ],
        target: [
            246,
            123,
            25,
        ],
    },
    {
        name: '梨黄',
        origin: [
            209,
            195,
            132,
        ],
        target: [
            254,
            219,
            117,
        ],
    },
    {
        name: '柠檬黄',
        origin: [
            252,
            212,
            55,
        ],
        target: [
            250,
            224,
            51,
        ],
    },
    {
        name: '柳黄',
        origin: [
            234,
            238,
            91,
        ],
        target: [
            255,
            252,
            5,
        ],
    },
    {
        name: '枇杷黄',
        origin: [
            252,
            162,
            6,
        ],
        target: [
            250,
            164,
            10,
        ],
    },
    {
        name: '明黄',
        origin: [
            254,
            223,
            10,
        ],
        target: [
            240,
            199,
            29,
        ],
    },
    {
        name: '秋香',
        origin: [
            206,
            170,
            20,
        ],
        target: [
            206,
            169,
            19,
        ],
    },
    {
        name: '乳鸭黄',
        origin: [
            255,
            202,
            12,
        ],
        target: [
            241,
            198,
            78,
        ],
    },
    {
        name: '石黄',
        origin: [
            233,
            197,
            100,
        ],
        target: [
            233,
            198,
            98,
        ],
    },
    {
        name: '藤黄',
        origin: [
            232,
            234,
            161,
        ],
        target: [
            240,
            189,
            18,
        ],
    },
    {
        name: '柘黄',
        origin: [
            234,
            137,
            37,
        ],
        target: [
            247,
            161,
            45,
        ],
    },
    {
        name: '杏黄',
        origin: [
            254,
            197,
            108,
        ],
        target: [
            251,
            187,
            83,
        ],
    },
    {
        name: '雄黄',
        origin: [
            248,
            137,
            24,
        ],
        target: [
            248,
            137,
            34,
        ],
    },
    {
        name: '赭黄',
        origin: [
            182,
            143,
            78,
        ],
        target: [
            187,
            123,
            47,
        ],
    },
    {
        name: '油菜花黄',
        origin: [
            251,
            218,
            65,
        ],
        target: [
            250,
            236,
            63,
        ],
    },
    {
        name: '宝石绿',
        origin: [
            65,
            174,
            59,
        ],
        target: [
            72,
            139,
            109,
        ],
    },
    {
        name: '草绿',
        origin: [
            156,
            176,
            63,
        ],
        target: [
            131,
            190,
            82,
        ],
    },
    {
        name: '粉绿',
        origin: [
            132,
            203,
            173,
        ],
        target: [
            137,
            226,
            191,
        ],
    },
    {
        name: '荷叶绿',
        origin: [
            26,
            104,
            64,
        ],
        target: [
            58,
            116,
            41,
        ],
    },
    {
        name: '孔雀绿',
        origin: [
            34,
            149,
            84,
        ],
        target: [
            40,
            151,
            95,
        ],
    },
    {
        name: '琉璃绿',
        origin: [
            28,
            87,
            83,
        ],
        target: [
            78,
            134,
            86,
        ],
    },
    {
        name: '明绿',
        origin: [
            126,
            166,
            96,
        ],
        target: [
            133,
            175,
            101,
        ],
    },
    {
        name: '青绿',
        origin: [
            17,
            122,
            117,
        ],
        target: [
            90,
            135,
            126,
        ],
    },
    {
        name: '松绿',
        origin: [
            53,
            91,
            54,
        ],
        target: [
            20,
            151,
            133,
        ],
    },
    {
        name: '蛙绿',
        origin: [
            70,
            184,
            135,
        ],
        target: [
            149,
            179,
            50,
        ],
    },
    {
        name: '玉簪绿',
        origin: [
            164,
            202,
            181,
        ],
        target: [
            187,
            198,
            181,
        ],
    },
    {
        name: '鹦鹉绿',
        origin: [
            91,
            173,
            36,
        ],
        target: [
            97,
            153,
            66,
        ],
    },
    {
        name: '油绿',
        origin: [
            0,
            84,
            50,
        ],
        target: [
            15,
            83,
            56,
        ],
    },
    {
        name: '玉色',
        origin: [
            187,
            243,
            198,
        ],
        target: [
            213,
            224,
            215,
        ],
    },
    {
        name: '藻绿',
        origin: [
            91,
            110,
            78,
        ],
        target: [
            126,
            186,
            88,
        ],
    },
    {
        name: '草白',
        origin: [
            220,
            220,
            210,
        ],
        target: [
            213,
            223,
            250,
        ],
    },
    {
        name: '缟素',
        origin: [
            249,
            249,
            241,
        ],
        target: [
            249,
            246,
            241,
        ],
    },
    {
        name: '汉白玉',
        origin: [
            248,
            243,
            237,
        ],
        target: [
            246,
            245,
            242,
        ],
    },
    {
        name: '荷花白',
        origin: [
            252,
            236,
            223,
        ],
        target: [
            226,
            235,
            217,
        ],
    },
    {
        name: '荔肉白',
        origin: [
            242,
            230,
            206,
        ],
        target: [
            239,
            233,
            213,
        ],
    },
    {
        name: '蜡白',
        origin: [
            222,
            227,
            230,
        ],
        target: [
            248,
            245,
            238,
        ],
    },
    {
        name: '茧白',
        origin: [
            230,
            237,
            243,
        ],
        target: [
            251,
            252,
            254,
        ],
    },
    {
        name: '雪白',
        origin: [
            255,
            254,
            249,
        ],
        target: [
            251,
            249,
            245,
        ],
    },
    {
        name: '莲子白',
        origin: [
            255,
            244,
            204,
        ],
        target: [
            252,
            251,
            250,
        ],
    },
    {
        name: '米白',
        origin: [
            241,
            237,
            228,
        ],
        target: [
            235,
            235,
            235,
        ],
    },
    {
        name: '象牙白',
        origin: [
            239,
            238,
            218,
        ],
        target: [
            245,
            240,
            210,
        ],
    },
    {
        name: '乳白',
        origin: [
            250,
            244,
            220,
        ],
        target: [
            246,
            243,
            225,
        ],
    },
    {
        name: '银白',
        origin: [
            241,
            240,
            236,
        ],
        target: [
            241,
            242,
            242,
        ],
    },
    {
        name: '红青',
        origin: [
            31,
            7,
            23,
        ],
        target: [
            34,
            25,
            28,
        ],
    },
    {
        name: '百草霜',
        origin: [
            86,
            86,
            86,
        ],
        target: [
            57,
            59,
            67,
        ],
    },
    {
        name: '玄青',
        origin: [
            44,
            48,
            73,
        ],
        target: [
            41,
            46,
            60,
        ],
    },
    {
        name: '玄色',
        origin: [
            54,
            53,
            59,
        ],
        target: [
            18,
            9,
            14,
        ],
    },
    {
        name: '缁色',
        origin: [
            39,
            43,
            55,
        ],
        target: [
            24,
            21,
            21,
        ],
    },
    {
        name: '皂色',
        origin: [
            67,
            68,
            70,
        ],
        target: [
            47,
            45,
            48,
        ],
    },
    {
        name: '斑鸠灰',
        origin: [
            168,
            167,
            162,
        ],
        target: [
            134,
            135,
            155,
        ],
    },
    {
        name: '橄榄灰',
        origin: [
            80,
            62,
            42,
        ],
        target: [
            148,
            147,
            150,
        ],
    },
    {
        name: '鸽子灰',
        origin: [
            170,
            170,
            170,
        ],
        target: [
            157,
            164,
            163,
        ],
    },
    {
        name: '古鼎灰',
        origin: [
            146,
            155,
            162,
        ],
        target: [
            114,
            114,
            114,
        ],
    },
    {
        name: '芦穗灰',
        origin: [
            189,
            173,
            173,
        ],
        target: [
            185,
            171,
            170,
        ],
    },
    {
        name: '狼烟灰',
        origin: [
            130,
            134,
            135,
        ],
        target: [
            67,
            79,
            90,
        ],
    },
    {
        name: '玫瑰灰',
        origin: [
            87,
            56,
            64,
        ],
        target: [
            155,
            129,
            130,
        ],
    },
    {
        name: '米灰',
        origin: [
            190,
            194,
            193,
        ],
        target: [
            163,
            156,
            157,
        ],
    },
    {
        name: '墨灰',
        origin: [
            103,
            102,
            108,
        ],
        target: [
            76,
            80,
            89,
        ],
    },
    {
        name: '铅灰',
        origin: [
            188,
            181,
            173,
        ],
        target: [
            116,
            116,
            125,
        ],
    },
    {
        name: '鹊灰',
        origin: [
            154,
            166,
            182,
        ],
        target: [
            99,
            108,
            134,
        ],
    },
    {
        name: '松鼠灰',
        origin: [
            80,
            64,
            51,
        ],
        target: [
            116,
            124,
            123,
        ],
    },
    {
        name: '水牛灰',
        origin: [
            48,
            47,
            53,
        ],
        target: [
            81,
            89,
            81,
        ],
    },
    {
        name: '铁灰',
        origin: [
            105,
            109,
            112,
        ],
        target: [
            83,
            83,
            83,
        ],
    },
    {
        name: '松烟灰',
        origin: [
            135,
            135,
            135,
        ],
        target: [
            100,
            117,
            129,
        ],
    },
    {
        name: '瓦罐灰',
        origin: [
            71,
            72,
            76,
        ],
        target: [
            106,
            105,
            109,
        ],
    },
    {
        name: '瓦灰',
        origin: [
            135,
            126,
            119,
        ],
        target: [
            92,
            96,
            99,
        ],
    },
    {
        name: '相思灰',
        origin: [
            120,
            132,
            158,
        ],
        target: [
            186,
            187,
            191,
        ],
    },
    {
        name: '乌贼灰',
        origin: [
            143,
            143,
            145,
        ],
        target: [
            59,
            62,
            77,
        ],
    },
    {
        name: '砚灰',
        origin: [
            136,
            149,
            165,
        ],
        target: [
            68,
            81,
            88,
        ],
    },
    {
        name: '雁灰',
        origin: [
            128,
            118,
            109,
        ],
        target: [
            106,
            108,
            125,
        ],
    },
    {
        name: '银灰',
        origin: [
            175,
            172,
            167,
        ],
        target: [
            200,
            202,
            201,
        ],
    },
    {
        name: '燕羽灰',
        origin: [
            92,
            81,
            61,
        ],
        target: [
            104,
            103,
            94,
        ],
    },
    {
        name: '荸荠紫',
        origin: [
            66,
            28,
            53,
        ],
        target: [
            80,
            49,
            64,
        ],
    },
    {
        name: '甘蔗紫',
        origin: [
            73,
            39,
            59,
        ],
        target: [
            73,
            39,
            53,
        ],
    },
    {
        name: '古铜紫',
        origin: [
            68,
            14,
            37,
        ],
        target: [
            116,
            93,
            103,
        ],
    },
    {
        name: '槿紫',
        origin: [
            128,
            108,
            157,
        ],
        target: [
            128,
            109,
            155,
        ],
    },
    {
        name: '绛紫',
        origin: [
            72,
            22,
            60,
        ],
        target: [
            99,
            35,
            62,
        ],
    },
    {
        name: '桔梗紫',
        origin: [
            135,
            116,
            244,
        ],
        target: [
            135,
            116,
            245,
        ],
    },
    {
        name: '龙葵紫',
        origin: [
            85,
            81,
            98,
        ],
        target: [
            49,
            47,
            50,
        ],
    },
    {
        name: '玫瑰紫',
        origin: [
            154,
            128,
            189,
        ],
        target: [
            148,
            115,
            176,
        ],
    },
    {
        name: '罗兰紫',
        origin: [
            212,
            163,
            195,
        ],
        target: [
            200,
            138,
            224,
        ],
    },
    {
        name: '暮山紫',
        origin: [
            142,
            124,
            214,
        ],
        target: [
            142,
            149,
            214,
        ],
    },
    {
        name: '茄花',
        origin: [
            219,
            119,
            231,
        ],
        target: [
            164,
            88,
            210,
        ],
    },
    {
        name: '椹汁紫',
        origin: [
            75,
            58,
            100,
        ],
        target: [
            66,
            16,
            41,
        ],
    },
    {
        name: '檀紫',
        origin: [
            77,
            45,
            56,
        ],
        target: [
            92,
            72,
            81,
        ],
    },
    {
        name: '藤萝紫',
        origin: [
            126,
            122,
            188,
        ],
        target: [
            126,
            122,
            188,
        ],
    },
    {
        name: '魏紫',
        origin: [
            126,
            12,
            113,
        ],
        target: [
            125,
            22,
            111,
        ],
    },
    {
        name: '雪紫',
        origin: [
            132,
            99,
            130,
        ],
        target: [
            134,
            101,
            132,
        ],
    },
    {
        name: '樱草紫',
        origin: [
            181,
            87,
            159,
        ],
        target: [
            164,
            103,
            196,
        ],
    },
    {
        name: '苋菜紫',
        origin: [
            162,
            38,
            108,
        ],
        target: [
            150,
            38,
            110,
        ],
    },
    {
        name: '猪肝紫',
        origin: [
            85,
            30,
            36,
        ],
        target: [
            84,
            41,
            48,
        ],
    },
    {
        name: '紫绛',
        origin: [
            77,
            40,
            83,
        ],
        target: [
            72,
            50,
            58,
        ],
    },
    {
        name: '山梗紫',
        origin: [
            98,
            100,
            159,
        ],
        target: [
            96,
            81,
            192,
        ],
    },
    {
        name: '紫薇花',
        origin: [
            181,
            134,
            206,
        ],
        target: [
            181,
            143,
            218,
        ],
    },
]
